# UnusedSlopeArrow Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoofFailures..::..UnusedSlopeArrow Property
BuiltInFailures..::..RoofFailures Class See Also
---
The tails of all slope arrows must lie on the roof boundary.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnusedSlopeArrow { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnusedSlopeArrow As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnusedSlopeArrow {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoofFailures Class
Autodesk.Revit.DB Namespace